; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	image4 - mode
	thermograph3 - mode
	thermograph1 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image4)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph2)
	(supports instrument1 image4)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(have_image Star7 infrared0)
	(have_image Planet8 image4)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 thermograph3)
	(have_image Planet11 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
6. (take_image satellite1 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 1 of 5
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
8. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 5
9. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 5
10. (take_image satellite0 phenomenon10 instrument0 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 2 of 5
11. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 2 of 5
12. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 3 of 5
13. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 3 of 5
14. (take_image satellite1 star7 instrument1 infrared0)
   added: (have_image star7 infrared0)
   goals met: 4 of 5
15. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 4 of 5
16. (take_image satellite1 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 5 of 5
